chcbaram/stm32h750/stm32h750_fw/src/lib/cubemx/stm32h750/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7xx_hal.h"
#include "stm32h7xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define SDCARD_CD_Pin GPIO_PIN_13
#define SDCARD_CD_GPIO_Port GPIOC
#define SPI1_CS_Pin GPIO_PIN_0
#define SPI1_CS_GPIO_Port GPIOC
#define SPI1_RS_Pin GPIO_PIN_1
#define SPI1_RS_GPIO_Port GPIOC
#define LCD_RESET_Pin GPIO_PIN_2
#define LCD_RESET_GPIO_Port GPIOC
#define JOYPAD_X_Pin GPIO_PIN_7
#define JOYPAD_X_GPIO_Port GPIOA
#define JOYPAD_Y_Pin GPIO_PIN_5
#define JOYPAD_Y_GPIO_Port GPIOC
#define BTN_HOME_Pin GPIO_PIN_9
#define BTN_HOME_GPIO_Port GPIOA
#define BTN_MENU_Pin GPIO_PIN_0
#define BTN_MENU_GPIO_Port GPIOD
#define BTN_SELECT_Pin GPIO_PIN_4
#define BTN_SELECT_GPIO_Port GPIOD
#define BTN_START_Pin GPIO_PIN_6
#define BTN_START_GPIO_Port GPIOD
#define BTN_B_Pin GPIO_PIN_5
#define BTN_B_GPIO_Port GPIOB
#define BTN_A_Pin GPIO_PIN_8
#define BTN_A_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
